zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW70AC/MCXW70AC_COMMON.h
/* GPIO - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral GPIO_A base address */
  #define GPIO_A_BASE                              (0x500C0000u)
  /** Peripheral GPIO_A base address */
  #define GPIO_A_BASE_NS                           (0x400C0000u)
  /** Peripheral GPIO_A base pointer */
  #define GPIO_A                                   ((GPIO_Type *)GPIO_A_BASE)
  /** Peripheral GPIO_A base pointer */
  #define GPIO_A_NS                                ((GPIO_Type *)GPIO_A_BASE_NS)
  /** Peripheral GPIO_B base address */
  #define GPIO_B_BASE                              (0x50090000u)
  /** Peripheral GPIO_B base address */
  #define GPIO_B_BASE_NS                           (0x40090000u)
  /** Peripheral GPIO_B base pointer */
  #define GPIO_B                                   ((GPIO_Type *)GPIO_B_BASE)
  /** Peripheral GPIO_B base pointer */
  #define GPIO_B_NS                                ((GPIO_Type *)GPIO_B_BASE_NS)
  /** Peripheral GPIO_C base address */
  #define GPIO_C_BASE                              (0x500A0000u)
  /** Peripheral GPIO_C base address */
  #define GPIO_C_BASE_NS                           (0x400A0000u)
  /** Peripheral GPIO_C base pointer */
  #define GPIO_C                                   ((GPIO_Type *)GPIO_C_BASE)
  /** Peripheral GPIO_C base pointer */
  #define GPIO_C_NS                                ((GPIO_Type *)GPIO_C_BASE_NS)
  /** Peripheral GPIO_D base address */
  #define GPIO_D_BASE                              (0x50196000u)
  /** Peripheral GPIO_D base address */
  #define GPIO_D_BASE_NS                           (0x40196000u)
  /** Peripheral GPIO_D base pointer */
  #define GPIO_D                                   ((GPIO_Type *)GPIO_D_BASE)
  /** Peripheral GPIO_D base pointer */
  #define GPIO_D_NS                                ((GPIO_Type *)GPIO_D_BASE_NS)
  /** Array initializer of GPIO peripheral base addresses */
  #define GPIO_BASE_ADDRS                          { GPIO_A_BASE, GPIO_B_BASE, GPIO_C_BASE, GPIO_D_BASE }
  /** Array initializer of GPIO peripheral base pointers */
  #define GPIO_BASE_PTRS                           { GPIO_A, GPIO_B, GPIO_C, GPIO_D }
  /** Array initializer of GPIO peripheral base addresses */
  #define GPIO_BASE_ADDRS_NS                       { GPIO_A_BASE_NS, GPIO_B_BASE_NS, GPIO_C_BASE_NS, GPIO_D_BASE_NS }
  /** Array initializer of GPIO peripheral base pointers */
  #define GPIO_BASE_PTRS_NS                        { GPIO_A_NS, GPIO_B_NS, GPIO_C_NS, GPIO_D_NS }
#else
  /** Peripheral GPIO_A base address */
  #define GPIO_A_BASE                              (0x400C0000u)
  /** Peripheral GPIO_A base pointer */
  #define GPIO_A                                   ((GPIO_Type *)GPIO_A_BASE)
  /** Peripheral GPIO_B base address */
  #define GPIO_B_BASE                              (0x40090000u)
  /** Peripheral GPIO_B base pointer */
  #define GPIO_B                                   ((GPIO_Type *)GPIO_B_BASE)
  /** Peripheral GPIO_C base address */
  #define GPIO_C_BASE                              (0x400A0000u)
  /** Peripheral GPIO_C base pointer */
  #define GPIO_C                                   ((GPIO_Type *)GPIO_C_BASE)
  /** Peripheral GPIO_D base address */
  #define GPIO_D_BASE                              (0x40196000u)
  /** Peripheral GPIO_D base pointer */
  #define GPIO_D                                   ((GPIO_Type *)GPIO_D_BASE)
  /** Array initializer of GPIO peripheral base addresses */
  #define GPIO_BASE_ADDRS                          { GPIO_A_BASE, GPIO_B_BASE, GPIO_C_BASE, GPIO_D_BASE }
  /** Array initializer of GPIO peripheral base pointers */
  #define GPIO_BASE_PTRS                           { GPIO_A, GPIO_B, GPIO_C, GPIO_D }
#endif
/** Interrupt vectors for the GPIO peripheral type */
#define GPIO_IRQS                                { GPIOA_INT0_IRQn, GPIOB_INT0_IRQn, GPIOC_INT0_IRQn, GPIOD_INT0_IRQn }
#define GPIO_S_IRQS                              { GPIOA_INT1_IRQn, GPIOB_INT1_IRQn, GPIOC_INT1_IRQn, GPIOD_INT1_IRQn }

/* INTM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral INTM_0 base address */
  #define INTM_0_BASE                              (0x50200000u)
  /** Peripheral INTM_0 base address */
  #define INTM_0_BASE_NS                           (0x40200000u)
  /** Peripheral INTM_0 base pointer */
  #define INTM_0                                   ((INTM_Type *)INTM_0_BASE)
  /** Peripheral INTM_0 base pointer */
  #define INTM_0_NS                                ((INTM_Type *)INTM_0_BASE_NS)
  /** Array initializer of INTM peripheral base addresses */
  #define INTM_BASE_ADDRS                          { INTM_0_BASE }
  /** Array initializer of INTM peripheral base pointers */
  #define INTM_BASE_PTRS                           { INTM_0 }
  /** Array initializer of INTM peripheral base addresses */
  #define INTM_BASE_ADDRS_NS                       { INTM_0_BASE_NS }
  /** Array initializer of INTM peripheral base pointers */
  #define INTM_BASE_PTRS_NS                        { INTM_0_NS }
#else
  /** Peripheral INTM_0 base address */
  #define INTM_0_BASE                              (0x40200000u)
  /** Peripheral INTM_0 base pointer */
  #define INTM_0                                   ((INTM_Type *)INTM_0_BASE)
  /** Array initializer of INTM peripheral base addresses */
  #define INTM_BASE_ADDRS                          { INTM_0_BASE }
  /** Array initializer of INTM peripheral base pointers */
  #define INTM_BASE_PTRS                           { INTM_0 }
#endif

/* ISP_AP - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral ISP_AP_0 base address */
  #define ISP_AP_0_BASE                            (0x50080000u)
  /** Peripheral ISP_AP_0 base address */
  #define ISP_AP_0_BASE_NS                         (0x40080000u)
  /** Peripheral ISP_AP_0 base pointer */
  #define ISP_AP_0                                 ((ISP_AP_Type *)ISP_AP_0_BASE)
  /** Peripheral ISP_AP_0 base pointer */
  #define ISP_AP_0_NS                              ((ISP_AP_Type *)ISP_AP_0_BASE_NS)
  /** Array initializer of ISP_AP peripheral base addresses */
  #define ISP_AP_BASE_ADDRS                        { ISP_AP_0_BASE }
  /** Array initializer of ISP_AP peripheral base pointers */
  #define ISP_AP_BASE_PTRS                         { ISP_AP_0 }
  /** Array initializer of ISP_AP peripheral base addresses */
  #define ISP_AP_BASE_ADDRS_NS                     { ISP_AP_0_BASE_NS }
  /** Array initializer of ISP_AP peripheral base pointers */
  #define ISP_AP_BASE_PTRS_NS                      { ISP_AP_0_NS }
#else
  /** Peripheral ISP_AP_0 base address */
  #define ISP_AP_0_BASE                            (0x40080000u)
  /** Peripheral ISP_AP_0 base pointer */
  #define ISP_AP_0                                 ((ISP_AP_Type *)ISP_AP_0_BASE)
  /** Array initializer of ISP_AP peripheral base addresses */
  #define ISP_AP_BASE_ADDRS                        { ISP_AP_0_BASE }
  /** Array initializer of ISP_AP peripheral base pointers */
  #define ISP_AP_BASE_PTRS                         { ISP_AP_0 }
#endif

